import 'package:epixure_web/testingEngine/data/models.dart';

class TestingRepository{
  List<Question> getQuestions(int page){
    List<Question> questions = [
      Question(question: "Я состою в счастливых и гармоничных отношениях", answers: ["Это о нас", "В основном, да", "Нет отношений и это ОК", "Не совсем", "Нет отношений и это не ОК"],indexes: [3, 22, 4, 2, 2, 6, 9, 9], ),
    Question(question: "Я счастливый человек и в гармонии с собой", answers: ["Каждый день", "Обычно, да", "Иногда", "Редко", "Совсем нет"],indexes: [3, 12, 4, 6, 2, 6, 6, 10]),
    Question(question: "Я чувствую себя очень одиноко", answers: ["Никогда", "Обычно нет", "Иногда да", "Часто", "Постоянно"],indexes: [3, 22, 4, 6, 1, 6, 6, 9]),
    Question(question: "Я знаю свои слабости и постоянно работаю над ними", answers: ["Знаю и работаю", "Да, знаю, всегда стараюсь проработать", "Нет-нет что-то делаю", "Знаю и не работаю", "Никогда не работаю над ними"],indexes: [3, 3, 4, 2, 2, 6, 2, 9]),
    Question(question: "Я люблю читать или слушать книги", answers: ["Книги моя жизнь", "Мне нравится", "Иногда", "Редко", "Совсем нет"],indexes: [0, 0, 0, 3, 0, 10, 5, 9]),
    Question(question: "Я легко покупаю все, что мне нужно, не думая о деньгах", answers: ["Легко", "Часто", "Не совсем", "Редко", "Никогда"],indexes: [12, 4, 0, 0, 18, 0, 15, 0]),
    Question(question: "Мне абсолютно нравится мое тело", answers: ["Оно идеально", "Нравится, но не все", "Что-то среднее", "Больше не нравится", "Не нравится полностью"],indexes: [20, 10, 0, 2, 5, 4, 2, 0]),
    Question(question: "Я регулярно, с удовольствием, путешествую", answers: ["Постоянно", "Довольно таки часто", "Я стараюсь", "Не совсем", "Нет"],indexes: [3, 4, 0, 0, 7, 0, 15, 9]),
    Question(question: "Я делаю много для моей семьи и друзей", answers: ["Всегда", "Это про меня", "Я стараюсь", "Даже не знаю", "Даже не знаю"],indexes: [0, 10, 22, 0, 0, 0, 5, 9]),
    Question(question: "У меня есть крутое хобби и время им заняться", answers: ["Конечно", "Вроде как", "Даже не знаю", "Нет, но мне и не нужно", "Я страдаю из-за его отсутствия"],indexes: [3, 0, 1, 2, 0, 23, 15, 9]),
    Question(question: "У меня достаточно настоящих друзей", answers: ["Друзья, это моя жизнь", "Достаточно", "Мне кажется, да", "Даже не знаю", "Нет настоящих"],indexes: [0, 0, 25, 0, 0, 0, 5, 0]),
    Question(question: "У меня много старых и сломанных вещей", answers: ["Только новые", "Нет таких", "У меня есть пара", "Да", "Завал"],indexes: [0, 0, 0, 0, 7, 0, 0, 0]),
    Question(question:  "Я чувствую, что занимаюсь именно тем, чем хочу, когда я работаю", answers: ["Абсолютно", "Почти", "Может быть лучше", "Совсем нет", "Я страдаю"],indexes: [0, 0, 0, 30, 3, 9, 0, 9]),
    Question(question: "Я люблю дом, где живу, и место, где он находится", answers: ["Я люблю", "Мне нравится", "Даже не знаю", "Скорее нет", "Ненавижу"],indexes: [0, 1, 15, 0, 7, 0, 2, 0]),
    Question(question: "Я веду здоровый образ жизни и питаюсь правильно", answers: ["Каждый день", "Обычно, да", "Не всегда", "Скорее нет", "Никогда"],indexes: [20, 1, 4, 2, 1, 6, 2, 9]),
    Question(question: "Я достаточно активно занимаюсь спортом", answers: ["vДа, регулярно", "Я стараюсь", "Не совсем", "Скорее нет", "Никогда"],indexes: [20, 0, 10, 0, 1, 6, 2, 0]),
    Question(question:  "Я зарабатываю досточно денег, занимаясь любимым делом", answers: ["Это про меня", "Да, вроде как", "Даже не знаю", "Скорее нет", "Точно не про меня"],indexes: [3, 0, 0, 27, 15, 6, 2, 0]),
    Question(question: "Каждый день одинаковый", answers: ["Все дни абсолютно разные", "Бывает, но редко", "Иногда бывает", "Часто бывает, это напрягает", "Одинаковый и я страдаю"],indexes: [3, 5, 4, 15, 2, 6, 2, 9]),
    Question(question: "У меня достаточно денег, чтобы о них не думать", answers: ["Это про меня", "Уже почти так", "Не всегда", "Очень мало", "Я страдаю в этом вопросе"],indexes: [1, 2, 1, 1, 15, 0, 2, 0]),
    Question(question: "У меня есть все вещи, о которых другие мечтают", answers: ["Прямо все", "Почти все", "Не все", "vОчень мало", "Нет ни одной вещи"],indexes: [1, 2, 1, 1, 6, 0, 2, 0]),
      Question(question: "Я хочу заменить свои материальные вещи лучшими", answers: ["Совсем нет", "Некоторые из них", "Половину точно", "Почти все", "Все"],indexes: [2, 2, 1, 1, 6, 6, 1, 0])
    ];
    return questions;
  }
  List<List<List<int>>> getHokins(){
    List<List<int>> hokins1= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,15,20,15,12,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins2= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,9,12,15,20,12,6,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,15,20,15,12,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins3= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins4= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins5= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins6= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins7= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins8= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins9= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins10= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins11= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins12= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins13= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins14= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins15= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];
    List<List<int>> hokins16= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins17= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins18= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins19= [
      [1,1,1,1,3,7,11,12,15,20,15,6,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [15,20,15,12,12,8,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins20= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1],
    ];
    List<List<int>> hokins21= [
      [1,1,1,1,3,7,11,15,20,15,11,7,3,2,1,1],
      [1,2,3,7,10,15,20,12,10,7,5,3,2,1,1,1],
      [5,6,7,10,15,20,15,7,5,3,2,1,1,1,1,1],
      [7,10,12,15,20,15,9,3,2,1,1,1,1,1,1,1],
      [10,12,15,20,15,10,6,3,2,1,1,1,1,1,1,1]
    ];


    return [hokins1,hokins2, hokins3, hokins4, hokins5,hokins6,hokins7,hokins8,hokins9,hokins10,hokins11,hokins12,hokins13,hokins14,hokins15,hokins16,hokins17,hokins18,hokins19,hokins20,hokins21];
  }

  Future<String> getmoduleName() async{
    return "Модуль 1:  Сферы жизни";
  }
}